ProgessBase/Documents/ДС_Баланс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ДС_Баланс</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Баланс</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДС_ПоказателиБаланса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Comment>Реквизит для сортировки показателей</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/Enums/ДС_ВариантыРасчетаСальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ДС_ВариантыРасчетаСальдо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СальдоНачальноеДебетовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СальдоНачальноеКредитовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СальдоКонечноеДебетовое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СальдоКонечноеКредитовое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ProgessBase/Catalogs/ДС_ПоказателиБаланса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДС_ПоказателиБаланса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Comment>Реквизит для сортировки показателей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОстатков</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДС_ВариантыРасчетаСальдо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Множитель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ProgessBase/Documents/ДС_Баланс/Ext/ObjectModule.bsl
Процедура ЗаполнитьПоказатели() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДС_ПоказателиБаланса.Ссылка КАК Показатель,
	|	ДС_ПоказателиБаланса.Порядок КАК Порядок
	|ИЗ
	|	Справочник.ДС_ПоказателиБаланса КАК ДС_ПоказателиБаланса
	|ГДЕ
	|	НЕ ДС_ПоказателиБаланса.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	
	Результат = Запрос.Выполнить();
	Баланс.Загрузить(Результат.Выгрузить());
КонецПроцедуры //ЗаполнитьПоказатели()

Функция РасчетСуммыСУсловием(Счет, Субконто1, Субконто2, Субконто3, Организация, Сумма, Условие, Показатель)
	Попытка
		Выполнить Условие;
	Исключение
		Сообщить("Ошибка при вычислении условия [" + Условие + "] в показателе [" + Показатель + "]: " + ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
	
	Возврат Сумма;
КонецФункции //РасчетСуммыСУсловием()

Процедура ДобавитьПоказатель(СтрокаТЧ, Показатель, Множитель = 1)
	Для каждого СтрокаСчета Из Показатель.Остатки Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МеждународныйОстаткиИОбороты.Счет,
		|	МеждународныйОстаткиИОбороты.Организация,
		|	МеждународныйОстаткиИОбороты.СуммаКонечныйОстатокДт КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Международный.ОстаткиИОбороты(&ПериодНач, &ПериодКон, Период, , Счет В ИЕРАРХИИ (&Счет), , ) КАК МеждународныйОстаткиИОбороты";
		
		Запрос.УстановитьПараметр("ПериодНач", 	ПериодНач);
		Запрос.УстановитьПараметр("ПериодКон", 	ПериодКон);
		Запрос.УстановитьПараметр("Счет", 		СтрокаСчета.СчетУчета);
		
		Если СтрокаСчета.ВидОстатков = Перечисления.ДС_ВариантыРасчетаСальдо.СальдоНачальноеДебетовое Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаКонечныйОстатокДт", "СуммаНачальныйОстатокДт");
			
		ИначеЕсли СтрокаСчета.ВидОстатков = Перечисления.ДС_ВариантыРасчетаСальдо.СальдоНачальноеКредитовое Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаКонечныйОстатокДт", "СуммаНачальныйОстатокКт");
			
		ИначеЕсли СтрокаСчета.ВидОстатков = Перечисления.ДС_ВариантыРасчетаСальдо.СальдоКонечноеКредитовое Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СуммаКонечныйОстатокДт", "СуммаКонечныйОстатокКт");
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ.Сумма 	= СтрокаТЧ.Сумма + Выборка.Сумма * СтрокаСчета.Множитель * Множитель;
		КонецЦикла;
		
	КонецЦикла; 
КонецПроцедуры //ДобавитьПоказатель()

Процедура Рассчитать() Экспорт
	Для каждого СтрокаТЧ Из Баланс Цикл
		СтрокаТЧ.Сумма 	= 0;
		ДобавитьПоказатель(СтрокаТЧ, СтрокаТЧ.Показатель);
	КонецЦикла; 
КонецПроцедуры //Рассчитать()

Процедура Печать() Экспорт
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.ДС_Баланс.ПолучитьМакет("Баланс");
	
	// Заголовок
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(Область);
	
	// Шапка
	Шапка = Макет.ПолучитьОбласть("Шапка");
	Шапка.Параметры.Заполнить(ЭтотОбъект);
	ТабДок.Вывести(Шапка);
	
	// Баланс
	Область = Макет.ПолучитьОбласть("БалансШапка");
	ТабДок.Вывести(Область);
	ОбластьБаланс = Макет.ПолучитьОбласть("Баланс");
	Для Каждого ТекСтрокаБаланс Из Баланс Цикл
		ОбластьБаланс.Параметры.Заполнить(ТекСтрокаБаланс);
		ТабДок.Вывести(ОбластьБаланс);
	КонецЦикла;

	ТабДок.ОтображатьСетку 		= Ложь;
	ТабДок.Защита 				= Ложь;
	ТабДок.ТолькоПросмотр 		= Ложь;
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	ТабДок.Показать();
КонецПроцедуры //Печать()
